# Data 200: Database Systems and Data Management for Data Analytics

# Homework 8: Introduction to SQL part 2

**Dickinson College**<br/>
**Spring 2022**<br/>
**Instructor:** Dick Forrester<br/>
<font color='red'>**Due Date and Time:** 11:59pm on Thursday, 3/24/2022 </font>
---
Enter your name in the markdown cell below.

# Name:

In [1]:
## RUN THIS CELL TO GET THE RIGHT FORMATTING AND TO LOAD NumPy
import requests
import numpy as np
from IPython.core.display import HTML
styles = requests.get("https://raw.githubusercontent.com/Harvard-IACS/2018-CS109A/master/content/styles/cs109.css").text
HTML(styles)

# Tasks

- **Make sure you have installed SQL Magic before beginning**--see pages 177-179 in the Course Notes.
- Review pages 203-232 in the Course Notes.
- Complete the **Sorting and Grouping** and **Aggregate Functions** chapters of the **Introduction to SQL** course on DataCamp.
- E-mail me your completed Jupyter notebook.

# Exercises

This homework will make use of both the `book.db` and `school.db` databases, which are available under Files in Teams.  I suggest that you review pages 181-183 and 225-227 in the Course Notes to familiarize yourself with the tables in these databases.  You may also want to open the `school.db` database in SQLiteStudio to examine the tables as you work on the queries below.

**Download the `book.db` and `school.db` databases from Teams and save them to the same directory as this notebook.**

**Then, run the code cells below to load the SQL Magic module and connect to the `book.db` database.**

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///book.db

'Connected: @book.db'

<div class="exercise"><b>Exercise 1:</b></div> 

With regards to the `countries` table, select all the rows where the country is classified as `'High income'`.  Project the `code` and `country` fields, plus create a new column called `landmiles` that is the land area in square miles (note that the area in square miles is equal to the square kilometers multiplied by 0.386102).  Sort by `landmiles` in descending order and limit the results to five rows.

The output from my solution is:<br>
<code>
code   country	    landmiles
USA	United States  3531837.15684
CAN	Canada	     3511022.39802
AUS	Australia	  2969904.30604
SAU	Saudi Arabia   829999.60838
CHL	Chile	      287079.192264
</code>

In [4]:
%%sql
/* Enter your SQL query below */

SELECT code, country, land*0.386102 AS landmiles FROM countries
WHERE income = 'High income'
ORDER BY landmiles DESC
LIMIT 5

 * sqlite:///book.db
Done.

[('USA', 'United States', 3531837.15684),
 ('CAN', 'Canada', 3511022.39802),
 ('AUS', 'Australia', 2969904.30604),
 ('SAU', 'Saudi Arabia', 829999.60838),
 ('CHL', 'Chile', 287079.192264)]

**Run the code cell below to connect to the `school.db` database.**

In [5]:
%sql sqlite:///school.db

'Connected: @school.db'

<div class="exercise"><b>Exercise 2:</b></div> 

In reference to the `instructors` table, select a new column `full_name` obtained as the last name, followed by a comma and a space, followed by the first name.  Order alphabetically and limit the results to five rows.

The output from my solution is:<br>
<code>
full_name
Aguilar, Stephen
Anderson, Philip
Arnaud, Antoine
Austin, Stephanie
Bailey, Jayden
</code>

In [6]:
%%sql
/* Enter your SQL query below */

SELECT instructorlast || ', ' || instructorfirst AS full_name FROM instructors
ORDER BY full_name ASC
LIMIT 5

   sqlite:///book.db
 * sqlite:///school.db
Done.

[('Aguilar, Stephen',),
 ('Anderson, Philip',),
 ('Arnaud, Antoine',),
 ('Austin, Stephanie',),
 ('Bailey, Jayden',)]

<div class="exercise"><b>Exercise 3:</b></div> 

In reference to the `courses` table, create a new column `catalog` obtained as the course subject, followed by a space, followed by the course number, followed by a colon and a space, followed by the course title. Only include `'MATH'` courses.  Order by course number in descending order and limit the results to five rows.

The output from my solution is:<br>
<code>
catalog
MATH 452: Senior Research
MATH 451: Senior Research
MATH 364: Independent Study
MATH 363: Independent Study
MATH 362: Directed Study
</code>

In [7]:
%%sql
/* Enter your SQL query below */

SELECT coursesubject || ' ' || coursenum || ': ' || coursetitle AS catalog FROM courses
WHERE coursesubject = 'MATH'
ORDER BY coursenum DESC
LIMIT 5

   sqlite:///book.db
 * sqlite:///school.db
Done.

[('MATH 452: Senior Research',),
 ('MATH 451: Senior Research',),
 ('MATH 364: Independent Study',),
 ('MATH 363: Independent Study',),
 ('MATH 362: Directed Study',)]

**Run the code cell below to connect to the `book.db` database.**

In [8]:
%sql sqlite:///book.db

'Connected: @book.db'

<div class="exercise"><b>Exercise 4:</b></div> 

Write an SQL query to determine the number of distinct female names in the `topnames` table.

Below is the output from my solution (can you mimic it?):<br>
<code>
num_female_names
              10
</code>

In [9]:
%%sql
/* Enter your SQL query below */

SELECT COUNT(DISTINCT name) AS num_female_names FROM topnames
WHERE sex = 'Female'

 * sqlite:///book.db
   sqlite:///school.db
Done.

[(10,)]

<div class="exercise"><b>Exercise 5:</b></div> 

From the `indicators` table, find the average life expectancy, the minimum year, and the maximum number of cell phone subscribers.

Below is the output from my solution (can you mimic it?):<br>
<code>
avg_life	     min_year   max_cell
64.00322182010733	1960	1469.88
</code>

In [10]:
%%sql
/* Enter your SQL query below */

SELECT AVG(life) AS avg_life, MIN(year) AS min_year, MAX(cell) AS max_cell
FROM indicators

 * sqlite:///book.db
   sqlite:///school.db
Done.

[(64.00322182010733, 1960, 1469.88)]

<div class="exercise"><b>Exercise 6:</b></div> 

With regards to the `indicators` table, use a select query to answer the question: which country and year had the highest cell phone number? **Hint:** use a subquery and MAX to find the overall highest cell phone number, then find which row has that number.

Below is the output from my solution:<br>
<code>
code	year
CHN	2017
</code>

In [11]:
%%sql
/* Enter your SQL query below */

SELECT code, year FROM indicators
WHERE cell = (SELECT MAX(cell) FROM indicators)

 * sqlite:///book.db
   sqlite:///school.db
Done.

[('CHN', 2017)]

<div class="exercise"><b>Exercise 7:</b></div> 

From the `countries` table, use a query to answer the question: how many countries are there in each region? Alias your new column as `num_countries`.  **Hint:** You will need to use a GROUP BY.

Below is the output from my solution:<br>
<code>
region	                num_countries
East Asia & Pacific	              37
Europe & Central Asia	            58
Latin America & Caribbean	        42
Middle East & North Africa	       21
North America	                     3
South Asia	                        8
Sub-Saharan Africa	               48
</code>

In [12]:
%%sql
/* Enter your SQL query below */

SELECT region, COUNT(country) AS num_countries
FROM countries
GROUP BY region

 * sqlite:///book.db
   sqlite:///school.db
Done.

[('East Asia & Pacific', 37),
 ('Europe & Central Asia', 58),
 ('Latin America & Caribbean', 42),
 ('Middle East & North Africa', 21),
 ('North America', 3),
 ('South Asia', 8),
 ('Sub-Saharan Africa', 48)]

<div class="exercise"><b>Exercise 8:</b></div> 

Use the `indicators` table to find the total world population in each year (as the sum of country populations). Use the alias `total_pop` for your new column.  Limit your results to five rows.

Below is the output from my solution:<br>
<code>
year	total_pop
1960	3014.6900000000014
1961	3055.3700000000003
1962	3107.859999999999
1963	3172.6700000000014
1964	3237.700000000004
</code>

In [13]:
%%sql
/* Enter your SQL query below */

SELECT year, SUM(pop)AS total_pop
FROM indicators
GROUP BY year
LIMIT 5

 * sqlite:///book.db
   sqlite:///school.db
Done.

[(1960, 3014.6900000000014),
 (1961, 3055.3700000000003),
 (1962, 3107.859999999999),
 (1963, 3172.6700000000014),
 (1964, 3237.700000000004)]

<div class="exercise"><b>Exercise 9:</b></div> 

Treating your query from Exercise 8 as a subquery, find the maximum for `total_pop` over *all* years. Use the alias `max_pop` for the new column.

Below is the output from my solution:<br>
<code>
max_pop
7567.310000000001
</code>

In [14]:
%%sql
/* Enter your SQL query below */

SELECT MAX(total_pop)
FROM (SELECT year, SUM(pop) AS total_pop FROM indicators GROUP BY year)

 * sqlite:///book.db
   sqlite:///school.db
Done.

[(7567.310000000001,)]

**Run the code cell below to connect to the `school.db` database.**

In [23]:
%sql sqlite:///school.db

'Connected: @school.db'

<div class="exercise"><b>Exercise 10:</b></div> 

In reference to the `school` database, write a query to obtain the number of sections for each class in the fall semester.  However, only include classes having at least 8 sections.  Project the course subject, course number, and a new column called `num_sections`.  **Hint:** You will need to use `GROUP BY classterm, coursesubject, coursenum` to uniquely identify the courses.  Order the results by the number of sections, course number, and course subject using:

`ORDER BY num_sections DESC, classterm, coursesubject, coursenum`

Below is the output from my solution:<br>
<code>
coursesubject	coursenum	num_sections
FYS	                101	          21
FYS	                102	          20
BIOL	               451	          12         
PHED	               350	          11
HIST	               451	           8
</code>

In [25]:
%%sql
/* Enter your SQL query below */

SELECT coursesubject, coursenum, COUNT(classsection) AS num_sections
FROM classes
WHERE classterm = 'FALL'
GROUP BY classterm, coursesubject, coursenum
HAVING COUNT(classsection) >= 8
ORDER BY num_sections DESC, classterm, coursesubject, coursenum
LIMIT 5;

   sqlite:///book.db
 * sqlite:///school.db
Done.

[('FYS', 101, 21),
 ('FYS', 102, 20),
 ('BIOL', 451, 12),
 ('PHED', 350, 11),
 ('HIST', 451, 8)]

<div class="exercise"><b>Exercise 11:</b></div> 

In reference to the `school` database, write a query to obtain the department chairs for Modern Language (`'LANG'`), Philosophy (`'PHIL'`), and Mathematics and Computer Science (`'MATH'`).  Note that you will need to use an inner join of the `departments` and `instructors` tables.  Project the department name, the chair's last name, and the chair's first name.

Below is the output from my solution:<br>
<code>
departmentname	              instructorlast	instructorfirst
Modern Language	             Brown	         Danielle
Mathematics & Computer Science  Bradley       	Betty
Philosophy	                  Singhal	       Aarav
</code>

In [17]:
%%sql
/* Enter your SQL query below */

   sqlite:///book.db
 * sqlite:///school.db
0 rows affected.

[]

<div class="exercise"><b>Exercise 12:</b></div> 

In reference to the `school` database, write a query to list all of the students who are mathematics (`'MATH'`) majors.  Order the results by last name, first name.  Limit the results to 6 rows.  Note that you will need to use an inner join on the `students` and `subjects` tables.

Below is the output from my solution:<br>
<code>
studentlast	 studentfirst
Barnett	     Larry
Campbell    	Gloria
Chapman	     Robert
Colombo         Giulia
Davis	       Crystal
Edwards     	Gary
</code>

In [18]:
%%sql
/* Enter your SQL query below */

   sqlite:///book.db
 * sqlite:///school.db
0 rows affected.

[]